; domain
(define (domain zeno-travel)
(:requirements :typing :fluents)
(:types aircraft person city - object)
(:predicates (at ?x - (either person aircraft) ?c - city)
             (in ?p - person ?a - aircraft))
(:functions (fuel ?a - aircraft)
            (distance ?c1 - city ?c2 - city)
            (slow-burn ?a - aircraft)
            (fast-burn ?a - aircraft)
            (capacity ?a - aircraft)
            (total-fuel-used)
	    (onboard ?a - aircraft)
            (zoom-limit ?a - aircraft)
            )


(:action board
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (at ?p ?c)
                 (at ?a ?c))
 :effect (and (not (at ?p ?c))
              (in ?p ?a)
		(increase (onboard ?a) 1)))


(:action debark
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (in ?p ?a)
                 (at ?a ?c))
 :effect (and (not (in ?p ?a))
              (at ?p ?c)
		(decrease (onboard ?a) 1)))

(:action fly 
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a))))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (slow-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a)))))
                                  
(:action zoom
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
                 (<= (onboard ?a) (zoom-limit ?a)))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
	)
) 

(:action refuel	
 :parameters (?a - aircraft ?c - city)
 :precondition (and (> (capacity ?a) (fuel ?a))
               (at ?a ?c)
		)
 :effect (and (assign (fuel ?a) (capacity ?a)))
)


)

; problem
(define (problem ZTRAVEL-2-10)
(:domain zeno-travel)
(:objects
	plane1 - aircraft
	plane2 - aircraft
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	person6 - person
	person7 - person
	person8 - person
	person9 - person
	person10 - person
	city0 - city
	city1 - city
	city2 - city
	city3 - city
	city4 - city
	)
(:init
	(at plane1 city1)
	(= (capacity plane1) 12766)
	(= (fuel plane1) 3687)
	(= (slow-burn plane1) 5)
	(= (fast-burn plane1) 14)
	(= (onboard plane1) 0)
	(= (zoom-limit plane1) 1)
	(at plane2 city2)
	(= (capacity plane2) 4570)
	(= (fuel plane2) 284)
	(= (slow-burn plane2) 2)
	(= (fast-burn plane2) 7)
	(= (onboard plane2) 0)
	(= (zoom-limit plane2) 6)
	(at person1 city3)
	(at person2 city4)
	(at person3 city0)
	(at person4 city1)
	(at person5 city1)
	(at person6 city0)
	(at person7 city0)
	(at person8 city3)
	(at person9 city4)
	(at person10 city4)
	(= (distance city0 city0) 0)
	(= (distance city0 city1) 581)
	(= (distance city0 city2) 960)
	(= (distance city0 city3) 656)
	(= (distance city0 city4) 915)
	(= (distance city1 city0) 581)
	(= (distance city1 city1) 0)
	(= (distance city1 city2) 620)
	(= (distance city1 city3) 595)
	(= (distance city1 city4) 693)
	(= (distance city2 city0) 960)
	(= (distance city2 city1) 620)
	(= (distance city2 city2) 0)
	(= (distance city2 city3) 572)
	(= (distance city2 city4) 777)
	(= (distance city3 city0) 656)
	(= (distance city3 city1) 595)
	(= (distance city3 city2) 572)
	(= (distance city3 city3) 0)
	(= (distance city3 city4) 920)
	(= (distance city4 city0) 915)
	(= (distance city4 city1) 693)
	(= (distance city4 city2) 777)
	(= (distance city4 city3) 920)
	(= (distance city4 city4) 0)
	(= (total-fuel-used) 0)
)
(:goal (and
	(at person1 city4)
	(at person2 city0)
	(at person3 city2)
	(at person4 city3)
	(at person5 city1)
	(at person6 city4)
	(at person7 city0)
	(at person8 city1)
	(at person9 city2)
	(at person10 city1)
	))

(:metric minimize (+ (* 5 (total-time))  (* 5 (total-fuel-used))))
)

; plan
1. (board person4 plane1 city1)
   deleted: (at person4 city1)
   added: (in person4 plane1)
   changed: (onboard plane1) from 0 to 1
   goals met: 2 of 10
2. (fly plane1 city1 city3)
   deleted: (at plane1 city1)
   added: (at plane1 city3)
   changed: (total-fuel-used) from 0 to 2975, (fuel plane1) from 3687 to 712
   goals met: 2 of 10
3. (refuel plane1 city3)
   changed: (fuel plane1) from 712 to 12766
   goals met: 2 of 10
4. (debark person4 plane1 city3)
   deleted: (in person4 plane1)
   added: (at person4 city3)
   changed: (onboard plane1) from 1 to 0
   goals met: 3 of 10
5. (board person1 plane1 city3)
   deleted: (at person1 city3)
   added: (in person1 plane1)
   changed: (onboard plane1) from 0 to 1
   goals met: 3 of 10
6. (board person8 plane1 city3)
   deleted: (at person8 city3)
   added: (in person8 plane1)
   changed: (onboard plane1) from 1 to 2
   goals met: 3 of 10
7. (fly plane1 city3 city4)
   deleted: (at plane1 city3)
   added: (at plane1 city4)
   changed: (total-fuel-used) from 2975 to 7575, (fuel plane1) from 12766 to 8166
   goals met: 3 of 10
8. (debark person1 plane1 city4)
   deleted: (in person1 plane1)
   added: (at person1 city4)
   changed: (onboard plane1) from 2 to 1
   goals met: 4 of 10
9. (board person2 plane1 city4)
   deleted: (at person2 city4)
   added: (in person2 plane1)
   changed: (onboard plane1) from 1 to 2
   goals met: 4 of 10
10. (board person9 plane1 city4)
   deleted: (at person9 city4)
   added: (in person9 plane1)
   changed: (onboard plane1) from 2 to 3
   goals met: 4 of 10
11. (board person10 plane1 city4)
   deleted: (at person10 city4)
   added: (in person10 plane1)
   changed: (onboard plane1) from 3 to 4
   goals met: 4 of 10
12. (fly plane1 city4 city1)
   deleted: (at plane1 city4)
   added: (at plane1 city1)
   changed: (total-fuel-used) from 7575 to 11040, (fuel plane1) from 8166 to 4701
   goals met: 4 of 10
13. (debark person8 plane1 city1)
   deleted: (in person8 plane1)
   added: (at person8 city1)
   changed: (onboard plane1) from 4 to 3
   goals met: 5 of 10
14. (debark person10 plane1 city1)
   deleted: (in person10 plane1)
   added: (at person10 city1)
   changed: (onboard plane1) from 3 to 2
   goals met: 6 of 10
15. (fly plane1 city1 city0)
   deleted: (at plane1 city1)
   added: (at plane1 city0)
   changed: (total-fuel-used) from 11040 to 13945, (fuel plane1) from 4701 to 1796
   goals met: 6 of 10
16. (debark person2 plane1 city0)
   deleted: (in person2 plane1)
   added: (at person2 city0)
   changed: (onboard plane1) from 2 to 1
   goals met: 7 of 10
17. (board person3 plane1 city0)
   deleted: (at person3 city0)
   added: (in person3 plane1)
   changed: (onboard plane1) from 1 to 2
   goals met: 7 of 10
18. (board person6 plane1 city0)
   deleted: (at person6 city0)
   added: (in person6 plane1)
   changed: (onboard plane1) from 2 to 3
   goals met: 7 of 10
19. (refuel plane1 city0)
   changed: (fuel plane1) from 1796 to 12766
   goals met: 7 of 10
20. (fly plane1 city0 city2)
   deleted: (at plane1 city0)
   added: (at plane1 city2)
   changed: (total-fuel-used) from 13945 to 18745, (fuel plane1) from 12766 to 7966
   goals met: 7 of 10
21. (debark person3 plane1 city2)
   deleted: (in person3 plane1)
   added: (at person3 city2)
   changed: (onboard plane1) from 3 to 2
   goals met: 8 of 10
22. (debark person9 plane1 city2)
   deleted: (in person9 plane1)
   added: (at person9 city2)
   changed: (onboard plane1) from 2 to 1
   goals met: 9 of 10
23. (fly plane1 city2 city4)
   deleted: (at plane1 city2)
   added: (at plane1 city4)
   changed: (total-fuel-used) from 18745 to 22630, (fuel plane1) from 7966 to 4081
   goals met: 9 of 10
24. (debark person6 plane1 city4)
   deleted: (in person6 plane1)
   added: (at person6 city4)
   changed: (onboard plane1) from 1 to 0
   goals met: 10 of 10
